{
    "aboutContent": {
        "title": "Hi! I'm Sigurd Hauan!",
        "p1": "I'm a final-year Computer Science student from NTNU specializing in software development. Currently, I work at MazeMap, where I mainly use Python and React to focus on backend tasks, particularly on map production and the admin interface.",
        "p2": "Feel free to contact me on LinkedIn:"
    },
    "aboutMessage": "Learn more about our company.",
    "mazeMapContent": [
        "I currently work as a Software Engineer Intern at Mazemap, you are most welcome to check out what we do! I started at MazeMap in 2022 as a summer intern, and continued in the position as a part-time intern. That summer I worked together with one other intern to create a standalone full-stack webapp to help add new customers. The app consisted of a backend written in Java along with a React frontend.",
        "This year, I have worked more closely together with one of the engineering teams and their roadmap tasks."
    ],
    "matchGeneratorContent": [
        "Ever wanted to create a matchplan for a football tournament where everyone plays everyone? This simple SPA i made lets you generate a matchplan for up to 100 teams."
    ],
    "lydenAvByenContent": [
        "In the classical NTNU course \"EIT\" we created a webapp with a map of noise levels in the city center of Trondheim. It was also possible to listen in on different locations where we had recorded the sounds of the area.",
        "I worked mostly with creating components that played these sounds. Unfortunately, the map is currently not live."
    ],
    "ffmpegContent": [
        "In the NTNU course \"Customer Driven Project\" i was on a team that looked into video compression for a customer. We used the already existing software FFmpeg wrapped in our own python script to compress eye-tracking videos."
    ],
    "pockballContent": [
        "In the NTNU course \"Software Architecture\" my group developed an android game called \"Pockball\", it was basicly a 8ball-pool clone we created from scratch using the library Lib-GDX. The game featured online multiplayer, where one could play vs a friend."
    ],
    "gitHubContent": [
        "Have a look at my GitHub profile! Most of what I have presented here you can find in my profile."
    ]
  }