{
    "aboutContent": {
      "title": "Hei! Jeg er Sigurd Hauan!",
      "p1": "Jeg er inne i mitt siste år på NTNU hvor jeg sommeren 2024 fullfører en mastergrad innen Datateknologi, med spesialisering innen programvaresystemer. Ved siden jobber jeg deltid hos MazeMap, der jobber jeg hovedsakelig med backend-oppgaver i Python og frontend-oppgaver i React som er relatert til kartproduksjonen.",
      "p2": "Ta gjerne kontakt med meg på LinkedIn:"
    },
    "mazeMapContent": [
      "Jeg jobber for tiden som Software Engineer Intern hos MazeMap. Du er hjertelig velkommen til å sjekke ut hva vi driver med.",
      "Jeg begynte hos MazeMap sommeren 2022 hvor jeg, sammen med en annen Intern laget en fullstack webapp som MazeMap kunne bruke til å enklere sette opp nye kunder. Den ble bygget med en backend i Java og frontend i React.",
      "Jeg fortsatte på deltid det året med samme prosjekt, men etter nyttår begynte jeg med oppgaver fra teamets roadmap. Dette fortsatte jeg med i sommer på fulltid. Blant annet jobbet jeg en del med 3D modeller som kan plasseres inn i kartene, og verktøy for å jobbe med disse. Videre har jeg igjen fortsatt på deltid."
    ],
    "matchGeneratorContent": [
      "Har du noen gang ønsket å lage en kampplan for en fotballturnering der alle spiller mot alle minst en gang? Denne enkle nettsiden jeg lagde lar deg generere en kampplan for opptil 100 lag."
    ],
    "lydenAvByenContent": [
      "Da jeg hadde \"EIT\" laget jeg, sammen med en annen denne nettsiden med et kart over støynivåene i Trondheim sentrum. Man kunne også lytte på ulike steder der vi hadde spilt inn lydene i området.",
      "Det var med selve avspillingen av lyd jeg jobbet mest med. Dessverre er ikke kartet for tiden oppe å kjører."
    ],
    "ffmpegContent": [
      "Da jeg hadde faget \"Kundestyrt prosjekt\" jobbet gruppen min med komprimering av høyhastighetsfilm av øyer. Dette var i samarbeid med firmaet Bulbitech. Gruppen tok i bruk programvaren FFmpeg, innpakket i vårt eget Python-skript for å komprimere videoene mens de ble tatt opp. Firmaet var spesielt fornøyd med den høye kompresjonsraten, kvaliteten på videoen og at vi klarte å gjøre det like fort som videoen ble tatt opp."
    ],
    "pockballContent": [
      "Da jeg hadde faget \"Programvarearkitektur\" utviklet min gruppe et Android-spill kalt \"Pockball\", det var i hovedsak en 8-ball pool-klone som vi laget fra bunnen av ved hjelp av biblioteket Lib-GDX. Spillet hadde nettbasert flerspillermodus der man kunne spille billiard mot en venn. Denne versjonen av billiard hadde også med seg litt artige \"Powerups\"."
    ],
    "gitHubContent": [
      "Ta gjerne en titt på GitHub-profilen min! Det meste av det jeg har presentert her har jeg tilgjengelig der."
    ]
  }
  